Tekla Open API Reference for Tekla Structures 2025
Reinforcement.GetRebarGeometriesWithoutClashes Method
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar as shown in model view. In case rebar polygon clashes with itself, physical points are moved to avoid clashing.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetRebarGeometriesWithoutClashes(
	bool withHooks
)
Public Function GetRebarGeometriesWithoutClashes (
	withHooks As Boolean
) As ArrayList
Parameters
withHooks
Type: System.Boolean
A parameter to determine whether the hook points should be included in the rebar geometry or not.
Return Value
Type: ArrayList
An array list that contains the RebarGeometry objects.
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace